/* ===============================================================================


 22.01.05 숙제
 <학생 과목 처리 시뮬>

1. 학생 학번 0~10 까지 존재
2. 1명에 대한 정보는 A과목에 대한 점수(0~100), 연도(YYYY), 학기(1~2)   3가지
3. 학생을 구분하는 Key는 학번.

* 학번에 대한 구조체로 코딩
* 링크드 리스트 형식으로 구현
* 정보 추가시 학번 중복 확인 예외처리

* 입력할 정보 : 학번, 이름, 점수, 연도, 학기
* 기능 : 확인, 추가, 수정

* 예시 )

[학번] [이름] [과목] [학기] [점수] [연도] [학기]
정보들
---
입력 >> 

 ++ 포인트 : 구현보다는 포인터를 공부한다는 마음으로 코딩


=============================================================================== */

#include <stdio.h>
#include <stdlib.h>

// 전역 변수


// 함수 선언 (공용)
void CLI();


// Main 함수
int main(){

}
